labis7/AVR---ATmega16---STK500/M1/M1/src/main.c
/*
***	Milestone 3 ***
 
 * Lab Team  : LAB41140558
 * Authors	 : Gialitakis - Skoufis 
 * Date		 : Friday 24/5/19 
 * Atmel Studio 7 - Windows 10 Pro
 * AVR Model : STK500 - ATmega16
 
 */ 

#include <stdio.h>
#include <asf.h>
#include <string.h>
#include <avr/io.h>
#include <avr/interrupt.h>

#define F_CPU   10000000
#define BAUD    9600
#define BRC     ((F_CPU/16/BAUD) - 1)
#define BUFFER_SIZE  256
#include <util/delay.h>
#include <avr/iom16.h>

//char mytxbuffer[BUFFER_SIZE];

uint8_t scan_pointer=0;

char myrxbuffer[BUFFER_SIZE];
uint8_t rxReadPos = 0;
uint8_t rxWritePos = 0;
uint8_t vi1_max,vi2_max,vi3_max=0;
uint8_t vj1_max,vj2_max,vj3_max=0;
uint8_t v1_max,v2_max,v3_max=0;
uint8_t vi_final,vj_final;
uint8_t ITflag=0;
uint8_t EOT=0;
uint8_t enemy_pass;
uint8_t ok_flag;
uint8_t move_done;
uint8_t MyColor;
uint8_t EndGameFlag;
uint8_t Time=2;
uint8_t time_tmp=2;
uint8_t mt=0;
uint8_t V[64]= {18,11,16,16,16,16,11,18,  11,10,13,13,13,13,10,11,  16,13,15,14,14,15,13,16,  16,13,14,15,15,14,13,16,  16,13,14,15,15,14,13,16,  16,13,15,14,14,15,13,16,  11,10,13,13,13,13,10,11,  18,11,16,16,16,16,11,18};//Weights per slot
volatile uint8_t ILflag = 0;
volatile uint8_t myTurn = 2;


void AnnounceRes(uint8_t res);
void init_timer(void);
void init_leds(void);
void init_serial(void);
void Transmit(char data[],uint8_t x,uint8_t y);
void Receive(void);
void Sendmsg(char* data);
void RST(void);
void Board(void);
void EndGame(void);
uint8_t CheckMove(uint8_t mi, uint8_t my, uint8_t color, uint8_t paint);
uint8_t checkmove_sim(uint8_t mi,uint8_t my,uint8_t color, uint8_t paint);
uint8_t vi_max,vj_max,v_max;

void Algo(void);
void Waiting(void);
void Check_Input(char data[]);
void simulate_opponent(void);
void algo_sim(void);
//Char definitions of the control inputs
//char SPACE[1];
uint8_t SPACE = 32;
char CR[1];
unsigned char USART_Receive(void);

volatile uint8_t *M ;
volatile uint8_t *MB ;




int main (void)
{
	board_init();
	init_serial();
	init_leds();
	// delimiter carriage return
	strcpy(CR,"\xD");

	//Turning off leds(atmega16)
	PORTB |= (1<<PORTB1); 
	PORTB |= (1<<PORTB2);
	PORTB |= (1<<PORTB3);
		

	//Game board initialization
	M= (uint8_t *)malloc(sizeof(uint8_t)*64);
	MB = (uint8_t *)malloc(sizeof(uint8_t)*64);

	volatile int i=0;
	/////////////////////////////////TASK MANAGER - RAM USAGE////////////////////////////////
	//%empty
	///////////////////////////////////////////////////////////////////////////

	volatile uint8_t y = 0 ;
	for(i = 0 ; i <= 7 ; i++)
	{
		for(y = 0 ; y <= 7 ; y++)
		{
			M[8*i + y] = (uint8_t)2 ; // 0 == black , 1 == white, 2 == empty
		}
	}
	//[ x , y ] ? [ X*8 + Y ](AVR), [ NUM ](AVR) ? [ (NUM)div8 , (NUM)mod8 ]
	M[3*8+3] = 1 ;
	M[3*8+4] = 0 ;
	M[4*8+3] = 0 ;
	M[4*8+4] = 1 ;
	

	/////////////////////////////INIT VALUE weight BOARD///////////////////////////
	//V= (uint8_t *)malloc(sizeof(uint8_t)*64);

	
	



	/////////////////////////////////////////////////////////////////////////////
	

	//buffer pointers init
	rxReadPos=0;
	rxWritePos=0;
	//flag Initialization 
	ITflag = 0;
	ILflag = 0;
	move_done = 0;
	myTurn = 2;
	MyColor = 1;
	

	sei();
	
	
	while(1){


		//Waiting for PC response - (ILLIGAL request)
		if(ILflag >= 1)
		{
			//Transmit("Waiting OK for announcement\r",0,"Waiting OK for announcement\r");
			_delay_ms(10);
			while(1){		
				if(ILflag == 2){ // we received the response we were waiting
					ILflag = 0;
					break;
				}
			}
			if(myrxbuffer[rxReadPos] == 79 && myrxbuffer[rxReadPos+1] == 75){ // "ok"
			   rxReadPos=rxWritePos;
				AnnounceRes(1); //WIN - LED1
				myTurn=2;
				
			
			}//future update : "else ILflag=1;" , wrong input avoidance

			if(myrxbuffer[rxReadPos] == 80 && myrxbuffer[rxReadPos+1] == 76){ //"PL"
				if(ITflag==1)
				{
					ITflag = 0;
					init_timer();
					
				}
				else
				{
					Transmit("QT\r",0 , strlen("QT\r"));
					myTurn=2;
				}						
					
			}	//future update : "else ILflag=1;" , wrong input avoidance		

			rxReadPos=rxWritePos;
		}
		
		
		if((myTurn == 0)&&(mt == 0)){
			//Possible speculation algo
			mt = 1;
			init_timer();
			myTurn = 0;
		}
			
		
		if(myTurn==1){ //When its avr's turn
			mt = 0; //reset flag for HIS turn			
			init_timer(); //reset timer
			myTurn = 1;  //Important - collision with  init_timer
			Algo();		//The actual algorithm
		}

	}

}
//////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////



// RESET FUNCTION: initializing game board and turning off leds
void RST(void)
{
	
	ILflag =0;
	move_done=0;
	myTurn=2;
	PORTB |= (1<<PORTB1);
	PORTB |= (1<<PORTB2);
	PORTB |= (1<<PORTB3);

	mt = 0; //flag reset
	myTurn=2;
	//Resetting board 
	for(uint8_t i = 0 ; i <= 7 ; i++)
	{
		for(uint8_t y = 0 ; y <= 7 ; y++)
		{
			M[8*i + y] = 2 ; // 0 == black , 1 == white, 2 == empty
		}
	}
	M[3*8+3] = 1 ;
	M[3*8+4] = 0 ;
	M[4*8+3] = 0 ;
	M[4*8+4] = 1 ;
	enemy_pass = 0;

	TCCR1B = 0x00;         //Clearing timer -- total reset
	TIMSK = (1 << TOIE1) ; //Overflow interrupts -- disabled
	Transmit("OK\r",0 , strlen("OK\r"));
	rxReadPos = rxWritePos;
	
}



//////////////////////////////////////////////////////////////////////////// ALGORITHM   /////////////////////////////////////////////////////////////////////////////
void Algo(void)
{
	uint8_t mi,my,i,j,u,z,ibar,ybar,skip;
	uint8_t istep,ystep;
	myTurn = 1;		//Important - collision with  init_timer
	
	v1_max = 0;
	v2_max = 0;
	v3_max = 0;


	char mymove[6];
	
	//The next 2 for loop are responsible to find(scanning whole board) our pawns  ----------------------------------------- U P D A T E : we will save the positions of our pawns
	for(mi=0;mi<=7;mi++)
	{
		for(my=0; my<=7; my++)
		{
			 // we found one of our pawns, so we start to check potential move 
			if(M[mi*8+my] == MyColor)  
			{					
				//The next 2 for loops find scanning the 8 slots/positions around the pawn we found.
				for(i = mi - 1; i<=(mi+1); ++i)
				{
					if(i<0||i>7) //Matrix out of border protection 
						continue;
					for(j = my - 1; j<=(my+1); ++j)
					{
						if(j<0||j>7) //Matrix out of border protection 
							continue;

						//our pawn has en enemy pawn adjacent to it,
						//so we will find the borders+direction we need to search
						if((M[i*8 + j] == !MyColor))		
						{

							//Setting up i barrier (board)
							if(i > mi)
							ibar = 7 ;
							else if(i == mi)
							ibar = 10;   //big enough, so the other axis will break while below
							else
							ibar = 0;
							
							//Setting up y barrier
							if(j > my)
							ybar = 7;
							else if(j == my)
							ybar = 10;
							else
							ybar = 0;

							//setting up steps, (for the loops)
							istep = i - mi;
							ystep = j - my;
							
							//start from the accepted neighbor
							u=i;
							z=j;
							


							skip = 1;//reset

