labis7/AVR---ATmega16---STK500/M1/M1/src/main.c
	char mymove[6];
	
	
	for(mi=0;mi<=7;mi++)
	{
		for(my=0; my<=7; my++)
		{

			if(M[mi*8+my] == !MyColor)
			{
				//The next 2 for loops find scanning the 8 slots/positions around the pawn we found.
				for(i = mi - 1; i<=(mi+1); ++i)
				{
					if(i<0||i>7) //Matrix out of border protection
					continue;
					for(j = my - 1; j<=(my+1); ++j)
					{
						if(j<0||j>7) //Matrix out of border protection
						continue;

						//so we will find the borders+direction we need to search
						if((M[i*8 + j] == MyColor))
						{

							//Setting up i barrier (board)
							if(i > mi)
							ibar = 7 ;
							else if(i == mi)
							ibar = 10;   //big enough, so the other axis will break while below
							else
							ibar = 0;
							
							//Setting up y barrier
							if(j > my)
							ybar = 7;
							else if(j == my)
							ybar = 10;
							else
							ybar = 0;

							//setting up steps, (for the loops)
							istep = i - mi;
							ystep = j - my;
							
							//start from the accepted neighbor
							u=i;
							z=j;
							


							skip = 1;//reset

							//Now,its gonna find a valid path(which will get colorized accordingly)
							while((u != (ibar+istep))&&(z != (ybar+ystep)))
							{
								if(M[u*8 + z] == !MyColor ) //Break, because we need empty slot(to put our move in it)
								{
									break;
								}
								
								if( M[u*8 + z] == 2){			//We found a valid empty slot
									skip = 0;
									move_done=1;
									
									checkmove_sim(u, z, !MyColor, 0); //Calculate and 'write'(if its the greatest till now) on board(in the specific slot we found) the result score of this possible move.
									break;
								}

								z+= ystep;
								u+= istep;
							}
							
						}//if check neighbors
					}//j for

				}//i for
			}//if  (find our pawn)

		}//for my

	}//for mi

	if(move_done)
	{
		return;
	}
	else
	v_max=0;
	return;


	
}


uint8_t checkmove_sim(uint8_t mi,uint8_t my,uint8_t color, uint8_t paint)
{
	volatile int i,j;
	uint8_t u,z,found,ibar,ybar,skip,pcounter;
	uint8_t istep,ystep;
	char mymove[6];
	pcounter=0;
	
	found = 0;//init before main loop
	for(i = mi - 1; i<=(mi+1); ++i)
	{
		if(i<0||i>7)
		continue;
		for(j = my - 1; j<=(my+1); ++j)
		{
			if(j<0||j>7)
			continue;
			if((M[i*8 + j] == color)||(M[i*8 + j] >= 2))
			;
			else
			{
				//Setting up i barrier
				if(i > mi)
				ibar = 7 ;
				else if(i == mi)
				ibar = 9;
				else
				ibar = 0;
				
				//Setting up y barrier
				if(j > my)
				ybar = 7;
				else if(j == my)
				ybar = 9;
				else
				ybar = 0;

				//setting up steps, (for the loops)
				istep = i - mi;
				ystep = j - my;
				//start from the accepted neighbor
				u=i;
				z=j;

				skip = 1;
				
				
				
				if(paint == 0) //just for finding the best slot
				{
					while((u != (ibar+istep))&&(z != (ybar+ystep)))
					{
						//check
						if( M[u*8 + z] >= 2)
						break;
						

						if(M[u*8 + z] == color )
						{

							
							//mark that it is a legal move
							found = 1;
							skip = 0;
							break;
						}
						z+= ystep;
						u+= istep;
						
					}
					
					if(!skip) //if a solution is found
					{
						u=i;
						z=j;
						while((u!=ibar)&&(z!=ybar))//barriers will never get reached.
						{
							if((M[u*8 + z] >= 2)||(M[u*8 + z] == color ))
							break;

							
							pcounter++;
							z+= ystep;
							u+= istep;
						}
					}

				}
				else
				{
					while((u != (ibar+istep))&&(z != (ybar+ystep)))
					{
						//check
						if( M[u*8 + z] >= 2)
						break;
						
						
						if(M[u*8 + z] == color )
						{
							
							M[mi*8 + my] = color;
							
							//mark that it is a legal move
							found = 1;
							skip = 0;
							break;
						}
						z+= ystep;
						u+= istep;
						
					}
					
					if(!skip) //if a solution is found
					{
						u=i;
						z=j;
						while((u!=ibar)&&(z!=ybar))//barriers will never get reached.
						{
							if((M[u*8 + z] >= 2)||(M[u*8 + z] == color ))
							break;

							M[u*8 + z] = color;
							z+= ystep;
							u+= istep;
						}
					}
				}//if paint
				
			}//if check
		}	  //y for
	}	  //x for
	if(paint == 0)
	{
		//Searching for the OPPONENT'S best move for the current scenario


		if(M[vi_max*8 + vj_max] <= pcounter +14 + V[mi*8 +my]) //14: OFFSET FOR OUR VALUE TABLE , + the weight of the slot
		{
			//remember on the board the latest max move.
			M[mi*8 + my] = pcounter +14 + V[mi*8 +my];

			// reset the last note of the max score on the board (there is no reason to save a value on board if its not the max)
			if(M[vi_max*8 + vj_max] > 2)
			M[vi_max*8 + vj_max] = 2;
			
			//Save the latest move()
			vi_max = mi;
			vj_max = my;
			v_max = pcounter +14 + V[mi*8 +my];
			
		}
	}

	if(found == 1)
	return 1;//Legal
	return 0;
}



void simulate_opponent(void)
{
	char mymove[6];
	

	uint8_t worst_op_move_value;
	
	if( v1_max > 0 ) //if we have an answer for opponent's last move(top of the 3)
	{
		
		//Backing up our main board, because the current state of our board will be used to speculate and decide
		for(uint8_t i=0; i<8; i++){
			for(uint8_t j=0; j<8; j++){
				MB[i*8+j]=M[i*8+j];
			}
		}

		// we make 1 of our best 3 possible moves(we are actual plating our move in the 1st scenario)
		checkmove_sim(vi1_max, vj1_max, MyColor, 1);
		//finding the best possible solution for opponent(without speculation), according to our move(1 of the 3 top moves)
		algo_sim();
		//the v#1,v#j are the i,j for v1_max value(ours),
		//and we save his move as the worst for now(there are 3 scenarios, we find HIS best move for each scenario and we pick the worst of the 3)
		vi_final = vi1_max;
		vj_final = vj1_max;
		worst_op_move_value = v_max;



	}
	if( v2_max > 0 )  //if we have an answer for opponent's last move(2nd best)
	{
		for(uint8_t i=0; i<8; i++){
			for(uint8_t j=0; j<8; j++){
				M[i*8+j]=MB[i*8+j];
			}
		}

		checkmove_sim(vi2_max, vj2_max, MyColor, 1);

		algo_sim();
		if(worst_op_move_value > v_max)
		{
			vi_final = vi2_max;
			vj_final = vj2_max;
			worst_op_move_value = v_max;
		}
	}
	if( v3_max > 0 )
	{
		for(uint8_t i=0; i<8; i++){
			for(uint8_t j=0; j<8; j++){
				M[i*8+j]=MB[i*8+j];
			}
		}
		checkmove_sim(vi3_max, vj3_max, MyColor, 1);
		algo_sim();
		if(worst_op_move_value > v_max)
		{
			vi_final = vi3_max;
			vj_final = vj3_max;
			worst_op_move_value = v_max;
		}
	}

	//Restoring the board(so we can make our final-decided move)
	for(uint8_t i=0; i<8; i++){
		for(uint8_t j=0; j<8; j++){
			M[i*8+j]=MB[i*8+j];
		}
	}
}



